In [1]:
import numpy as np
import pandas as pd

In [6]:
time = pd.read_csv("messages.csv")
date = pd.read_csv("orders.csv")

In [8]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [9]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [10]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [11]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

Working with dates

In [12]:
date["date"] = pd.to_datetime(date["date"])

In [13]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

1.Extract year

In [25]:
date["date_year"] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year  month  month_no
660 2019-04-01        6599       23       1       2019      4         4
935 2019-10-30        1931        0      57       2019     10        10
70  2019-10-29        6443       16       1       2019     10        10
370 2019-01-23        4573        2       3       2019      1         1
710 2019-02-28         128       12       1       2019      2         2

2.Extract month

In [26]:
date["month"] = date['date'].dt.month
date.sample(5)

          date  product_id  city_id  orders  date_year  month  month_no
265 2019-04-28        2850       16       6       2019      4         4
747 2018-08-06        2490        7       9       2018      8         8
175 2018-09-04        3125        1      10       2018      9         9
102 2018-08-30        3328       29       1       2018      8         8
10  2019-10-24        6339       26       1       2019     10        10

In [28]:
date['month_name'] = date['date'].dt.month_name()
date.sample(5)

,date,product_id,city_id,orders,date_year,month,month_no,month_name
635,2018-11-11,6295,3,84,2018,11,11,November
63,2018-08-29,2841,16,3,2018,8,8,August
939,2018-08-07,5278,13,1,2018,8,8,August
890,2018-09-03,3107,9,2,2018,9,9,September
98,2019-07-03,4794,14,3,2019,7,7,July

In [29]:
date["date_day"] = date['date'].dt.day
date.sample(5)

,date,product_id,city_id,orders,date_year,month,month_no,month_name,date_day
752,2019-06-21,6174,3,12,2019,6,6,June,21
321,2019-12-04,2981,26,461,2019,12,12,December,4
44,2018-08-03,803,23,9,2018,8,8,August,3
833,2019-11-04,6695,9,5,2019,11,11,November,4
128,2019-11-23,6204,24,2,2019,11,11,November,23

In [30]:
date["day_of_week"] = date["date"].dt.day_of_week
date.sample(5)

,date,product_id,city_id,orders,date_year,month,month_no,month_name,date_day,day_of_week
272,2019-10-22,3995,18,58,2019,10,10,October,22,1
800,2018-12-06,586,28,3,2018,12,12,December,6,3
420,2018-08-07,7288,14,5,2018,8,8,August,7,1
542,2019-06-10,2652,18,69,2019,6,6,June,10,0
88,2019-10-11,925,25,10,2019,10,10,October,11,4

In [32]:
date["date_day_name"] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders','month']).head()

,date,date_year,month_no,month_name,date_day,day_of_week,date_day_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [34]:
#is this weekend?
date['date_is_weekend'] = np.where(date['date_day_name'].isin(["Saturday",'Sunday']), 1,0)

date.drop(columns=['product_id','city_id','orders','month']).head()

,date,date_year,month_no,month_name,date_day,day_of_week,date_day_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

 Extract week of the year

In [39]:
date['date_week'] = date["date"].dt.weekday

date.drop(columns=['product_id','city_id','orders','month']).head()

,date,date_year,month_no,month_name,date_day,day_of_week,date_day_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1
3,2019-08-17,2019,8,August,17,5,Saturday,1,5
4,2019-01-06,2019,1,January,6,6,Sunday,1,6

In [40]:
date["Quarter"] = date["date"].dt.quarter

date.drop(columns=['product_id','city_id','orders','month']).head()

,date,date_year,month_no,month_name,date_day,day_of_week,date_day_name,date_is_weekend,date_week,Quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1

In [41]:
date['semester'] = np.where(date['Quarter'].isin([1,2]), 1,2)

date.drop(columns=['product_id','city_id','orders','month']).head()

,date,date_year,month_no,month_name,date_day,day_of_week,date_day_name,date_is_weekend,date_week,Quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1,1

In [45]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 12, 13, 23, 31, 36, 930783)

In [44]:
today - date['date']

0     2195 days 23:12:37.126490
1     2677 days 23:12:37.126490
2     2608 days 23:12:37.126490
3     2310 days 23:12:37.126490
4     2533 days 23:12:37.126490
                 ...
995   2623 days 23:12:37.126490
996   2564 days 23:12:37.126490
997   2412 days 23:12:37.126490
998   2477 days 23:12:37.126490
999   2251 days 23:12:37.126490
Name: date, Length: 1000, dtype: timedelta64[ns]

In [46]:
(today - date['date']).dt.days

0      2195
1      2677
2      2608
3      2310
4      2533
       ...
995    2623
996    2564
997    2412
998    2477
999    2251
Name: date, Length: 1000, dtype: int64

In [53]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, "m"),0)

0      3162212.0
1      3856292.0
2      3756932.0
3      3327812.0
4      3648932.0
         ...
995    3778532.0
996    3693572.0
997    3474692.0
998    3568292.0
999    3242852.0
Name: date, Length: 1000, dtype: float64

In [54]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [55]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [56]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [57]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [58]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [59]:
today - time['date']

0     4381 days 22:41:36.930783
1     4245 days 23:51:36.930783
2     4731 days 23:10:36.930783
3     4033 days 23:00:36.930783
4     4431 days 00:20:36.930783
                 ...
995   5020 days 22:41:36.930783
996   4342 days 00:17:36.930783
997   4806 days 23:54:36.930783
998   4922 days 23:57:36.930783
999   4195 days 00:06:36.930783
Name: date, Length: 1000, dtype: timedelta64[ns]

In [60]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.786001e+08
1      3.668539e+08
2      4.088418e+08
3      3.485340e+08
4      3.828396e+08
           ...
995    4.338097e+08
996    3.751499e+08
997    4.153245e+08
998    4.253471e+08
999    3.624484e+08
Name: date, Length: 1000, dtype: float64

In [61]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.310002e+06
1      6.114232e+06
2      6.814031e+06
3      5.808901e+06
4      6.380661e+06
           ...
995    7.230162e+06
996    6.252498e+06
997    6.922075e+06
998    7.089118e+06
999    6.040807e+06
Name: date, Length: 1000, dtype: float64

In [62]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      105166.693592
1      101903.860259
2      113567.176925
3       96815.010259
4      106344.343592
           ...
995    120502.693592
996    104208.293592
997    115367.910259
998    118151.960259
999    100680.110259
Name: date, Length: 1000, dtype: float64